package exercise;

public class MakeMbtiList {

	public static String[][] makeList(){
		
		String[][] mbtiList = {
								{"ISTJ" ,"책임감이 강하며 현실적이다. 매사에 철저하고 보수적이다"},
								{"ISFJ" ,"차분하고 헌신적이며 인내심이 강하다. 타인의 감정 변화에 주의를 기울인다"},
								{"INFJ" ,"높은 통찰력으로 사람들에게 영감을 준다. 공동체의 이익을 중요시한다."},
								{"INTJ" ,"의지가 강하고 독립적이다. 분석력이 뛰어나다."},
								{"ISTP" ,"과묵하고 분석적이며 적응력이 강하다."},
								{"ISFP" ,"온화하고 겸손하다. 삶의 여유를 만끽한다."},
								{"INFP" ,"성실하고 이해심 많으며 개방적이다. 잘 표현하지 않으나 내적 신념이 강하다."},
								{"INTP" ,"지적 호기심이 높으며 잠재력과 가능성을 중요시한다."},
								{"ESTP" ,"느긋하고 관용적이며 타협을 잘 한다. 현실적 문제 해결에 능숙하다."},
								{"ESFP" ,"호기심이 많으며 개발적이다. 구체적인 사실을 중시한다."},
								{"ENFP" ,"상상력이 풍부하고 순발력이 뛰어나다. 일상적인 활동에 지루함을 느낀다."},
								{"ENTP" ,"박학다식하고 독창적이다. 끊임없이 새로운 시도를 한다."},
								{"ESTJ" ,"체계적으로 일하고 규칙을 준수한다. 사실적 목표 설정에 능하다."},
								{"ESFJ" ,"사람에 대한 관심이 많으며 친절하다. 동정심이 많다."},
								{"ENFJ" ,"사교적이고 타인의 의견을 존중한다. 비판을 받으면 예민하게 반응한다."},
								{"ENTJ" ,"철저한 준비를 하며 활동적이다. 통솔력이 있으며 단호하다."},
							};
				
		return mbtiList;
	};
		
	
}
